---
title: DocumentPreviewSettings
classe: Autodesk.Revit.DB.DocumentPreviewSettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# DocumentPreviewSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `documentPreviewSettings.IsValidObject` | Boolean |
| `Boolean IsViewUpdateForced { get; }` | `documentPreviewSettings.IsViewUpdateForced` | Boolean |
| `ElementId PreviewViewId { get; set; }` | `documentPreviewSettings.PreviewViewId` | ElementId |
| `Void Dispose()` | `documentPreviewSettings.Dispose()` | Void |
| `Void ForceViewUpdate(Boolean)` | `documentPreviewSettings.ForceViewUpdate(forceViewUpdate)` | Void |
| `Boolean IsViewIdValidForPreview(ElementId)` | `documentPreviewSettings.IsViewIdValidForPreview(viewId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```